# IExternalServer Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IExternalServer Members
IExternalServer Interface Methods See Also
---
The IExternalServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDescription | Implement this method to return a description of the server. |
| GetName | Implement this method to return the name of the server. |
| GetServerId | Implement this method to return the id of the server. |
| GetServiceId | Implement this method to return the id of the service. |
| GetVendorId | Implement this method to return the id of the vendor of the server. |

# See Also
IExternalServer Interface
Autodesk.Revit.DB.ExternalService Namespace